//1

let text = "В 1 тихом сумеречном свете звезд, природа обретает свое загадочное величие. Луна, словно серебряный медальон, висит на  3 небесной подвеске, освещая темные уголки 8 земли. Ветер ласкает лицо, несущий с собой запахи цветов и звуки ночной природы. Тени играют в танце, создавая иллюзию живого 5 хореографического спектакля."

var countGlasnie = 0
var countSoglasnie = 0
var countTsifri = 0
var countOstText = 0

for i in text {
    switch i {
    case "а", "о", "и", "е", "э", "ы", "у", "ё", "ю", "я" : countGlasnie += 1
    case "б", "в", "г", "д", "ж", "з", "й", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ" : countSoglasnie += 1
    case "0", "1", "2", "3", "4", "5", "6", "7", "8", "9" : countTsifri += 1
    default: countOstText += 1
    }
}

print("Количество гласных букв в тексте: \(countGlasnie)")
print("Количество согласных букв в тексте: \(countSoglasnie)")
print("Количество цифр в тексте: \(countTsifri)")
print("Количество осталных символов в тексте: \(countOstText)")

//2

let age = 27

switch age {
case 0...12 :
    print("Детство")
case 13...19 :
    print("Подростковый период")
case 20...35 :
    print("Юность")
case 36...60 :
    print("Зрелость")
case 61...100 :
    print("Пожилой возраст")
default: break
}

//3

let fio = ["Усмонов", "Санжар", "Пардабоевич"]

let f = fio[0]
let i = fio[1]
let o = fio[2]

switch(f.first, i.first, o.first) {
case ("А", _, _), ("О", _, _) : print("Привет \(i)!")
case (_, "Е", _), (_, "З", _) : print("Привет \(f)!")
case (_, _, "В"), (_, _, "Д") : print("Привет \(i) \(o)!")
default : print("Привет \(f) \(i) \(o)!")
}

